from task3 import task3

# Task: Напишите программу для поиска k наименьших элементов в заданном массиве.
# Элементы в массиве могут располагаться в любом порядке.


def main():
    print('Task 4')
    task3(array_reversed=True)


if __name__ == '__main__':
    main()
